gagan/sample/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 455522338]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["password_digest", "$2a$04$K8hXj5nK16cx6SQOaz0XW.mMyKvnbpHES.2HR4E55HDokVoe.3Tb."], ["updated_at", "2015-04-07 05:30:32.447380"], ["id", 455522338]]
---
  def update
    @user =User.find(params[:id])
    if @user.update_attributes(user_params)